Revit 2027 API
IExternalCommandAvailability Methods
The IExternalCommandAvailability type exposes the following members.
Methods
Name | Description
IsCommandAvailable |  Implement this method to provide control over whether your external command is enabled or disabled.
Top
See Also
Reference
IExternalCommandAvailability Interface
Autodesk.Revit.UI Namespace